#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-01c74b98a6d260f3d]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:668551228068:cluster/my-ecs-cluster]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=my-ecs-task]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-02787ed54c853ceea]
aws_subnet.subnet1: Refreshing state... [id=subnet-0aaa9511a64803743]
aws_subnet.subnet2: Refreshing state... [id=subnet-0a791d9cb0090bcde]
aws_security_group.security_group: Refreshing state... [id=sg-00080908f6a4d4c50]
aws_lb_target_group.ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5]
aws_route_table.route_table: Refreshing state... [id=rtb-02528595d8bf1d3bc]
aws_route_table_association.subnet2_route: Refreshing state... [id=rtbassoc-0a1d894bc474c418b]
aws_route_table_association.subnet1_route: Refreshing state... [id=rtbassoc-099f03d9eb0bca898]
aws_alb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:loadbalancer/app/ecs-alb/ae2a46a3b24d6c94]
aws_launch_template.ecs_lt: Refreshing state... [id=lt-0348c2a0e2c3f92c1]
aws_autoscaling_group.ecs_asg: Refreshing state... [id=terraform-20240819135012409500000001]
aws_alb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:listener/app/ecs-alb/ae2a46a3b24d6c94/decec3b9d08b7af5]
aws_ecs_capacity_provider.capacity_provider: Refreshing state... [id=arn:aws:ecs:us-east-1:668551228068:capacity-provider/capacity_provider]
aws_ecs_cluster_capacity_providers.ecs_cluster_capacity_providers: Refreshing state... [id=my-ecs-cluster]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-1:668551228068:service/my-ecs-cluster/my-ecs-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb_listener.ecs_alb_listener will be updated in-place
  ~ resource "aws_alb_listener" "ecs_alb_listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:668551228068:listener/app/ecs-alb/ae2a46a3b24d6c94/decec3b9d08b7af5"
      ~ port              = 80 -> 3000
        tags              = {}
        # (4 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_autoscaling_group.ecs_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "ecs_asg" {
      ~ desired_capacity                 = 2 -> 1
        id                               = "terraform-20240819135012409500000001"
        name                             = "terraform-20240819135012409500000001"
        # (26 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:us-east-1:668551228068:service/my-ecs-cluster/my-ecs-service"
        name                               = "my-ecs-service"
        tags                               = {}
        # (15 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "dockergs" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5" -> null
        }
      + load_balancer {
          + container_name   = "dockergs"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lb_target_group.ecs_tg must be replaced
-/+ resource "aws_lb_target_group" "ecs_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/ecs-target-group/52256d45ca7a58b5" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-east-1:668551228068:loadbalancer/app/ecs-alb/ae2a46a3b24d6c94",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "ecs-target-group"
      + name_prefix                        = (known after apply)
      ~ port                               = 80 -> 3000 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      ~ target_group_health {
          ~ dns_failover {
              ~ minimum_healthy_targets_count      = "1" -> (known after apply)
              ~ minimum_healthy_targets_percentage = "off" -> (known after apply)
            }

          ~ unhealthy_state_routing {
              ~ minimum_healthy_targets_count      = 1 -> (known after apply)
              ~ minimum_healthy_targets_percentage = "off" -> (known after apply)
            }
        }

      ~ target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
**Pushed by: @omkarsathe01, Action: pull_request**